In [1]:
import pandas as pd

In [2]:
from sklearn.preprocessing import OneHotEncoder

In [3]:
# Create a sample dataframe with a categorical variable
df = pd.DataFrame({'color' : ['red','green','yellow','green','red','yellow']})

In [4]:
df

    color
0     red
1   green
2  yellow
3   green
4     red
5  yellow

In [5]:
# create an instance of OneHotEncoder
encoder = OneHotEncoder()

In [6]:
encoded = encoder.fit_transform(df[['color']])

In [7]:
encoded.toarray()

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [8]:
import pandas as pd
encoded_df=pd.DataFrame(encoded.toarray(), columns=encoder.get_feature_names_out())

In [9]:
encoder.get_feature_names_out()

array(['color_green', 'color_red', 'color_yellow'], dtype=object)

In [10]:
encoded_df

   color_green  color_red  color_yellow
0          0.0        1.0           0.0
1          1.0        0.0           0.0
2          0.0        0.0           1.0
3          1.0        0.0           0.0
4          0.0        1.0           0.0
5          0.0        0.0           1.0

In [11]:
pd.concat([df,encoded_df],axis=1)

    color  color_green  color_red  color_yellow
0     red          0.0        1.0           0.0
1   green          1.0        0.0           0.0
2  yellow          0.0        0.0           1.0
3   green          1.0        0.0           0.0
4     red          0.0        1.0           0.0
5  yellow          0.0        0.0           1.0

## Label And Ordinal Encoding

In [12]:
import pandas as pd

In [13]:
from sklearn.preprocessing import LabelEncoder

In [14]:
# Create a sample dataframe with a categorical variable
df = pd.DataFrame({'color' : ['red','green','yellow','green','red','yellow']})

In [15]:
df

    color
0     red
1   green
2  yellow
3   green
4     red
5  yellow

In [16]:
# Create an instance of Labelencoder
encoder=LabelEncoder()

In [17]:
encoder.fit_transform(df['color'])

array([1, 0, 2, 0, 1, 2])

In [18]:
## Ordinal Encoding

In [19]:
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder

# Create a sample dataframe with an ordinal variable
df = pd.DataFrame({'size': ['small','medium','large','medium','small','large']})

In [20]:
## Create an instance of the OrdinalEncoder class and fit_transform
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [24]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

## Target Guided Ordinal Encoding

In [26]:
import pandas as pd

# Create a smple dataframe with a categorical variable and a target variable
df = pd.DataFrame({
    'city':['New York','London','Paris','Tokyo','New York','Paris'],
    'price':[200,150,300,250,180,320]
})

In [27]:
df.head()

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180

In [28]:
## Calculate the mean price for each city
mean_price=df.groupby('city')['price'].mean().to_dict()
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [29]:
## replace each city with its mean price
df['city_encoded']=df['city'].map(mean_price)

In [30]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [32]:
import seaborn as sns

sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]